{
    "matthias-bannach": {
        "slug": "matthias-bannach",
        "firstName": "Matthias",
        "lastName": "Bannach",
        "bio": "Matthias has been working in software development for over 30 years in which he has developed embedded systems, systems management, web solutions, mobile apps and recently DB and ERP solutions and web based BI infrastructure. After facing a mostly Microsoft environment he forsake Linux command-line tools for administration and embraced PowerShell as an alternative for the odds-and-ends of development and operations.",
        "sessions": [
            "powershell-the-super-beast"
        ]
    },
    "dave-burke": {
        "slug": "dave-burke",
        "firstName": "Dave",
        "lastName": "Burke",
        "bio": "Dave launched his first web site on an IBM AIX RISC/6000 machine in 1994 and has been building web applications ever since. After working in Red Hat Linux and PHP in the mid 90's he spent 15 years with Microsoft Technologies before returning to his Linux roots in 2012. He currently specializes in Java Development, is author of the Java Code Generation Tool [CodeJohnny](http://codejohnny.com/), and works as a Freelance Developer and Consultant to companies moving from proprietary environments to Linux and Open Source Solutions. His blog is located at [nixmash.com](http://nixmash.com/).",
        "twitter": {
            "href": "https://twitter.com/daveburkevt",
            "title": "daveburkevt"
        },
        "sessions": [
            "this-linux-life"
        ]
    },
    "john-cicilio": {
        "slug": "john-cicilio",
        "firstName": "John",
        "lastName": "Cicilio",
        "bio": "John Cicilio works as a Software Development Manager at MyWebGrocer. John has a passion for the intersection of science, mathematics and technology.",
        "sessions": [
            "building-a-web-controlled-telepresence-rover"
        ]
    },
    "breandan-considine": {
        "slug": "breandan-considine",
        "firstName": "Breandan",
        "lastName": "Considine",
        "bio": "Breandan is a Java developer and technical evangelist at JetBrains.",
        "twitter": {
            "href": "https://twitter.com/breandan",
            "title": "breandan"
        },
        "sessions": [
            "java-object-oriented-querying"
        ]
    },
    "christian-cote": {
        "slug": "christian-cote",
        "firstName": "Christian",
        "lastName": "Coté",
        "bio": "Christian Coté is an IT professional with more than 14 years of experience working in data warehouse and business intelligence projects. Before SSIS was released, Christian developed ETL processes using a range of tools on multiple platforms. Christian has been a presenter at a number of conferences and code camps. He currently co-leads the SQL Server PASS chapter in Montreal as well as Global French SQL PASS Chapter. He is also SQL Server MVP.",
        "twitter": {
            "href": "https://twitter.com/Christian_SQL",
            "title": "Christian_SQL"
        },
        "sessions": [
            "modernizing-your-data-warehouse-for-hadoop"
        ]
    },
    "david-coutu": {
        "slug": "david-coutu",
        "firstName": "David",
        "lastName": "Coutu",
        "bio": "David Coutu has been developing code for over 15 years, primarily web/server applications on the JVM. Currently he works for Dealer.com as a developer and scrum master, working on their mobile application. When not spending time with his family, you might catch him playing board games or dabbling in music.",
        "sessions": [
            "behavior-driven-development"
        ]
    },
    "amy-coutu": {
        "slug": "amy-coutu",
        "firstName": "Amy",
        "lastName": "Coutu",
        "bio": "Amy Coutu is the Information Technology Director at Logic Supply, a South Burlington-based industrial computer company. Amy has an extensive background with more than 15 years of experience leading, building and delivering software solutions. In her current role she manages a team of developers and system administrators who are responsible for all things IT for the company.",
        "sessions": [
            "architecting-your-solution"
        ]
    },
    "hetal-dave": {
        "slug": "hetal-dave",
        "firstName": "Hetal",
        "lastName": "Dave",
        "bio": "Hetal Dave is a Software Engineer and Technical Lead for C2, a IT consulting company based in Colchester, VT. She has been working in Software Development for over 10 years, helping clients such as Keurig, NRG Systems, Crane & Co., Hershey and Vermont Teddy Bear. Hetal develops eCommerce and CMS applications using .NET, C#, jQuery and other technologies. She is a Microsoft Certified Professional (MCP) and a Sitecore Certified Developer. Hetal holds a Master’s Degree in Computer Science from RIMS in London, UK.",
        "sessions": [
            "clean-code"
        ]
    },
    "kathleen-dollard": {
        "slug": "kathleen-dollard",
        "firstName": "Kathleen",
        "lastName": "Dollard",
        "bio": "Kathleen Dollard is .NET Coach for Crystal MEF Lab. She has been a Microsoft MVP since 1998 and has given hundreds of speeches around the world. She has worked extensively with compositional architectures in relation to specific development platforms. She's interested in making core .NET technologies available to all coders to enable them to write better software faster. Kathleen is also a long-time advocate of generative techniques and is the author of *Code Generation in Microsoft .NET* (from Apress). She has published numerous articles on a range of .NET technologies. Kathleen is active in the Northern Colorado .NET SIG, the Denver Visual Studio User Group, and the Northern Colorado Architect's Group.",
        "twitter": {
            "href": "https://twitter.com/kathleendollard",
            "title": "kathleendollard"
        },
        "sessions": [
            "better-code-better-debugging"
        ]
    },
    "cori-drew": {
        "slug": "cori-drew",
        "firstName": "Cori",
        "lastName": "Drew",
        "bio": "Cori Drew is a consultant with Improving Enterprises in Addison, TX. She started her programming career as a web developer before cutting her OOP teeth (& falling in love with C#) in 2003 in .NET Framework 1.1. Cori was a programmer for 8.5 years before discovering there was a developer community in 2009. Appreciation for growth & learning, enabled by our tech community, has inspired her to try to pay it forward.",
        "twitter": {
            "href": "https://twitter.com/coridrew",
            "title": "coridrew"
        },
        "sessions": [
            "git-and-tfs"
        ]
    },
    "rob-friesel": {
        "slug": "rob-friesel",
        "firstName": "Rob",
        "lastName": "Friesel",
        "bio": "Rob Friesel is a 10+ year veteran of Dealer.com and a Senior User Interface Developer there; he is also a Certified ScrumMaster. He is passionate about front-end development and has been described as both a \"JavaScript pedant\" and a \"merge conflict savant.\" His first book, *The PhantomJS Cookbook* was released in June 2014.",
        "twitter": {
            "href": "https://twitter.com/founddrama",
            "title": "founddrama"
        },
        "sessions": [
            "tales-from-the-scrum-bowl"
        ]
    },
    "russell-fustino": {
        "slug": "russell-fustino",
        "firstName": "Russell",
        "lastName": "Fustino",
        "bio": "Russ Fustino is a Xamarin Developer Evangelist and CEO of Fustino Brothers, Inc (FBI), an app building company. FBI Tull apps are endorsed by Jethro Tull. Russ is a highly experienced software developer evangelist, Windows 8 and Phone 8 app developer having published many apps. He has a passion for software development and tools through conveying technology via live seminars, webcasts, blogs, photos and internet video productions. Russ was awarded Microsoft Most Valuable Professional (MVP) in Client Development and 2013 INETA Lifetime Achievement Award winner for helping educate, entertain and enlighten over 1 million programmers. Russ heads up an INETA Tampa Windows Phone user group [www.wp8ug.com](http://www.wp8ug.com/). Check out Russ' new blog at [www.russtoolshed.net/blog](http://www.russtoolshed.net/blog) and follow [@FustinoBrothers](https://twitter.com/FustinoBrothers) and [@RussFustino](https://twitter.com/RussFustino).",
        "twitter": {
            "href": "https://twitter.com/russfustino",
            "title": "russfustino"
        },
        "sessions": [
            "building-c-sharp-xamarin-forms-apps"
        ]
    },
    "brie-hoblin": {
        "slug": "brie-hoblin",
        "firstName": "Brie",
        "lastName": "Hoblin",
        "bio": "Web Developer turned QA Engineer. Girl Develop It instructor & supporter, Ruby enthusiast.",
        "twitter": {
            "href": "https://twitter.com/bhoblin",
            "title": "bhoblin"
        },
        "sessions": [
            "qa-basics"
        ]
    },
    "jon-hoguet": {
        "slug": "jon-hoguet",
        "firstName": "Jon",
        "lastName": "Hoguet",
        "bio": "Senior UI Developer at Dealer.com.",
        "sessions": [
            "angular-js-in-practice"
        ]
    },
    "jeremy-hutchinson": {
        "slug": "jeremy-hutchinson",
        "firstName": "Jeremy",
        "lastName": "Hutchinson",
        "bio": "Jeremy, a Senior Developer at Ontuitive, has been developing line of business applications for 15 years primarily in the Microsoft Stack. He has a passion for writing clean, scalable code and sharing what he has learned with other.",
        "twitter": {
            "href": "https://twitter.com/finercode",
            "title": "finercode"
        },
        "sessions": [
            "techniques-for-cross-platform-dot-net-development"
        ]
    },
    "jason-kanaris": {
        "slug": "jason-kanaris",
        "firstName": "Jason",
        "lastName": "Kanaris",
        "bio": "Jason Kanaris works for Stony Brook University as a full-stack developer. He has been building web applications for over 10 years, mostly on the Microsoft stack. In his spare time he works with embedded devices, such as the Netduino and Arduino, incorporating them into his smart home project.",
        "twitter": {
            "href": "https://twitter.com/phantomtypist",
            "title": "phantomtypist"
        },
        "sessions": [
            "the-internet-of-things"
        ]
    },
    "richa-khandelwal": {
        "slug": "richa-khandelwal",
        "firstName": "Richa",
        "lastName": "Khandelwal",
        "bio": "Richa Khandelwal is a developer at Dealer.com and Rover Games, LLC. She is passionate about Service Oriented Architecture and enjoys writing backend services primarily in JVM languages. She is an active member of Girl Develop It, Burlington chapter and enjoys taking an active role in the Vermont tech community. She considers herself a traveller and her personal goal is to experience a new place every year!",
        "sessions": [
            "managing-builds-with-gradle"
        ]
    },
    "josh-lee": {
        "slug": "josh-lee",
        "firstName": "Josh",
        "lastName": "Lee",
        "bio": "Josh Lee is the owner and director of QC Creative, a new digital agency in Burlington. He specializes in crafting elegant and effective solutions to challenging technological problems.\n\nJosh has been developing and managing websites for over 12 years. He is a full-stack developer with specific expertise in building accessible websites with WordPress.",
        "twitter": {
            "href": "https://twitter.com/joshleecreates",
            "title": "joshleecreates"
        },
        "sessions": [
            "using-grunt-js-to-automate-your-wordpress-workflow"
        ]
    },
    "brian-lloyd-newberry": {
        "slug": "brian-lloyd-newberry",
        "firstName": "Brian",
        "lastName": "Lloyd-Newberry",
        "bio": "Brian Lloyd-Newberry is the Enterprise Architect at Dealer.com, where he works with the team to implement a Service Oriented Architecture that scales across hundreds and hundreds of application instances powering applications that reach more than 70% of US Automotive Dealers.",
        "twitter": {
            "href": "https://twitter.com/brianln",
            "title": "brianln"
        },
        "sessions": [
            "deploying-your-applications-with-docker"
        ]
    },
    "maureen-mcelaney": {
        "slug": "maureen-mcelaney",
        "firstName": "Maureen",
        "lastName": "McElaney",
        "bio": "Maureen McElaney founded the Burlington chapter of Girl Develop It, which offers low cost workshops for women who want to learn how to code. At her day job she is a QA Engineer at Dealer.com.",
        "twitter": {
            "href": "https://twitter.com/Mo_Mack",
            "title": "Mo_Mack"
        },
        "sessions": [
            "build-a-more-vibrant-tech-community"
        ]
    },
    "darrel-miller": {
        "slug": "darrel-miller",
        "firstName": "Darrel",
        "lastName": "Miller",
        "bio": "Darrel has been building distributed business applications for more than 20 years. He is an active member of the .NET community and OSS contributor. When he's not reading IETF specifications in order to answer Stack Overflow questions, or writing tooling to help people build hypermedia driven client applications, you will find him enjoying time with his wife and daughter in Montreal, Quebec. Darrel works as a developer advocate at Runscope ensuring the best support possible to .NET developers who are building and consuming Web APIs. Darrel has been a long time member of the Microsoft Web API advisory board, a Microsoft Integration MVP and recently co-authored the O'Reilly book, *Designing Evolvable Web APIs with ASP.NET*.",
        "twitter": {
            "href": "https://twitter.com/darrel_miller",
            "title": "darrel_miller"
        },
        "sessions": [
            "take-control-of-your-interface"
        ]
    },
    "mitch-miller": {
        "slug": "mitch-miller",
        "firstName": "Mitch",
        "lastName": "Miller",
        "bio": "Mitch Miller is a Ph.D. chemist who has been developing, delivering, supporting scientific software solutions for over 20 years.",
        "sessions": [
            "geek-meets-science"
        ]
    },
    "kyle-mitofsky": {
        "slug": "kyle-mitofsky",
        "firstName": "Kyle",
        "lastName": "Mitofsky",
        "bio": "Kyle Mitofsky currently serves as the Software Development Team Technical Lead at the Vermont Department of Health. He enjoys reading code, writing code, talking about code, and answering questions about code from co-workers and anonymous internet strangers. He's interested in desktop, mobile, and web development technologies, especially if they're on the .NET stack. He blogs about coding at [www.codingeverything.com](http://www.codingeverything.com/).",
        "twitter": {
            "href": "https://twitter.com/KyleMit2",
            "title": "KyleMit2"
        },
        "sessions": [
            "pulling-your-website-up-by-your-twitter-bootstraps"
        ]
    },
    "nik-molnar": {
        "slug": "nik-molnar",
        "firstName": "Nik",
        "lastName": "Molnar",
        "bio": "Nik Molnar is a New Yorker, Microsoft MVP, ASP & Azure Insider and co-founder of Glimpse, an open source diagnostics and debugging tool. Originally from Homestead, Florida, Nik specializes in web development, web performance, web API's and community management. In his spare time, Nik can be found cooking up a storm in the kitchen, hanging with his wife, speaking at conferences, and working on other open source projects.",
        "twitter": {
            "href": "https://twitter.com/nikmd23",
            "title": "nikmd23"
        },
        "sessions": [
            "azure-web-sites-secrets-exposed"
        ]
    },
    "john-need": {
        "slug": "john-need",
        "firstName": "John",
        "lastName": "Need",
        "bio": "John Need is a Senior UI Engineer at iSystems in Colchester, Vermont, who discovered you can make a decent living building complicated, enterprise web applications. He spends his down time tinkering with Arduinos, collecting fossils, making beer, hiking Vermont and explaining how to make complicated things simple.",
        "twitter": {
            "href": "https://twitter.com/JohnNeed",
            "title": "JohnNeed"
        },
        "sessions": [
            "awesome-workflows-with-grunt-bower-and-yeoman"
        ]
    },
    "mark-olofson": {
        "slug": "mark-olofson",
        "firstName": "Mark",
        "lastName": "Olofson",
        "bio": "Mark Olofson is a second year UVM doctoral student and a graduate research fellow at the Tarrant Institute for Innovative Education. Olofson is a fan of content-driven technology integration and blending brick-and-mortar with virtual learning environments. He previously taught middle and high school science and mathematics in Colorado and Los Cabos, Mexico.",
        "sessions": [
            "it-takes-a-village"
        ]
    },
    "mark-sawczuk": {
        "slug": "mark-sawczuk",
        "firstName": "Mark",
        "lastName": "Sawczuk",
        "bio": "Big Data Scientist interested in predictive analytics, HPC, cloud computing, and novel ways to use visualization to extract information from data.",
        "twitter": {
            "href": "https://twitter.com/ChasingBigData",
            "title": "ChasingBigData"
        },
        "sessions": [
            "d3-js"
        ]
    },
    "eric-smith": {
        "slug": "eric-smith",
        "firstName": "Eric",
        "lastName": "Smith",
        "bio": "Eric Smith is Senior Vice President of Product Development at Middlebury Interactive Languages in Vermont, which provides online content and tools for world language learning. He has worked in a long series of mainstream imperative languages, starting with 6502 machine code. He attributes the long overdue industrial interest in concurrent computing and program correctness as much to the easy access to old research papers as multi-core processors. He spends a lot of time reading those papers. Eric is a regular speaker on functional programming and is currently producing a course on Scala for Pluralsight, which will be published in early Fall.",
        "twitter": {
            "href": "https://twitter.com/eric_s_smith",
            "title": "eric_s_smith"
        },
        "sessions": [
            "programming-in-the-2020s"
        ]
    },
    "tony-surma": {
        "slug": "tony-surma",
        "firstName": "Tony",
        "lastName": "Surma",
        "bio": "Tony Surma is the CTO of Microsoft's Disaster Response program which is responsible for the development and deployment of Microsoft and their partners' technologies to enable response organizations' critical relief efforts and connect communities affected by natural disasters throughout the world. He is a member of the core team for Random Hacks of Kindness on behalf of Microsoft and is one of founders of the Humanitarian Toolbox initiative. He now spends seemingly equal amounts of time in making presentations at work and writing code at home and at work with a technical focus on user experience (UX) of mobile, web and desktop applications and the architecture of the large cloud applications they depend on. Beyond work, Tony is always looking forward to volunteering to help non-profits leverage angle brackets, semi-colons and command line switches.",
        "twitter": {
            "href": "https://twitter.com/tonysurma",
            "title": "tonysurma"
        },
        "sessions": [
            "build-x-platform-apps-that-work-when-all-else-fails"
        ]
    },
    "peter-vile": {
        "slug": "peter-vile",
        "firstName": "Peter",
        "lastName": "Vile",
        "bio": "Peter Vile received his master degree from Colorado State University in computer science with a focus on software engineering specializing in distributed systems and aspect oriented middleware. Since then he has been a developing web based solutions and services in the Java ecosystem in several domains such as defense, telecom and now automotive. Currently he works for Dealer.com focused internal and external integration projects. While not chasing his two boys around he tries to stay up on messaging technologies and is currently dabbling in Scala, Play and Akka.",
        "sessions": [
            "resilient-applications-with-actors"
        ]
    },
    "anthony-van-der-hoorn": {
        "slug": "anthony-van-der-hoorn",
        "firstName": "Anthony",
        "lastName": "van der Hoorn",
        "bio": "Anthony van der Hoorn is a co-founder of Glimpse, and a regular speaker on such topics as Open Source, Web Practices and Diagnostics for the Web. Anthony specializes in web and front end development with technologies such as JavaScript, CSS, and HTML. He's bounced between living and working New York City and his home town of Brisbane, Australia – he's back in the USA at the moment. Anthony previously worked in the Financial Services sector developing high frequency trading systems and, in his spare time, he can be found out and about taking photos, speaking at conferences, and working on other Open Source projects.",
        "twitter": {
            "href": "https://twitter.com/anthony_vdh",
            "title": "anthony_vdh"
        },
        "sessions": [
            "modern-web-diagnostics-with-a-glimpse-into-asp-dot-net"
        ]
    }
}